<a href="https://colab.research.google.com/github/RsdTanmoy/Machine-Learning-Pandas/blob/main/Pandas_Lecture_10(Merging_Function).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Pandas Merging Function**

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.DataFrame({'ID':[1,2,3,4],'Class':[9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [ ]:
df5 = pd.DataFrame({'ID':[1,2,3,4],'Class':[9,10,11,12]})
df5

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [ ]:
df2 = pd.DataFrame({'ID':[1,2,3,4],'Name':['A','B','C','D']})
df2

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [ ]:
df3 = pd.DataFrame({'ID':[1,2,3,5],'Name':['A','B','C','D']})
df3

   ID Name
0   1    A
1   2    B
2   3    C
3   5    D

In [ ]:
df4 = pd.DataFrame({'ID':[5,6,7,8],'Name':['A','B','C','D']})
df4

   ID Name
0   5    A
1   6    B
2   7    C
3   8    D

**Pandas merge on**

In [ ]:
pd.merge(df1,df2)

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [ ]:
pd.merge(df1,df2,on='ID')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [ ]:
pd.merge(df2,df1,on='ID')

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11
3   4    D     12

In [ ]:
pd.merge(df1,df3,on='ID')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

**Pandas merge how**

In [ ]:
pd.merge(df1,df3,how='outer')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   4   12.0  NaN
4   5    NaN    D

In [ ]:
pd.merge(df1,df3,how='left')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [ ]:
pd.merge(df1,df3,how='right')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5    NaN    D

**Pandas merge indicator**

In [ ]:
pd.merge(df1,df3,how='outer',indicator=True)

   ID  Class Name      _merge
0   1    9.0    A        both
1   2   10.0    B        both
2   3   11.0    C        both
3   4   12.0  NaN   left_only
4   5    NaN    D  right_only

**Pandas merge left_index/right_index**

In [ ]:
pd.merge(df1,df4,left_index=True,right_index=True)

   ID_x  Class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

**Pandas merge suffixes**

In [ ]:
pd.merge(df1,df5,on='ID',suffixes=('_Higher','_Middle'))

   ID  Class_Higher  Class_Middle
0   1             9             9
1   2            10            10
2   3            11            11
3   4            12            12